caseCnt = int(input())

for f in range(0, caseCnt):
  floor = int(input())
  ho = int(input())
  res = [[]]

  for d in range(ho + 1):
    res[0].append(0)

  for d in range(1, ho+1):
    res[0][d] = d


  for i in range(1, floor + 1):
    res.append([0])
    for d in range(1, ho + 1):
      res[i].append(0)
      for k in range(1, d+1):
        res[i][d] += res[i-1][k]

  print(res[floor][ho])

# 0층 1호 1
# 0층 2호 2
# 0층 3호 3
# 0층 4호 4
# 0층 5호 5

# 1층 1호 1
# 1층 2호 1+2=3
# 1층 3호 1+2+3=6
# 1층 4호 1+2+3+4=10
# 1층 5호 1+2+3+4+5=15

# 2층 1호 1
# 2층 2호 1+1+2=4                           1*2 + 2
# 2층 3호 1+1+2+1+2+3=10                    1*3 + 2*2 + 3*1
# 2층 4호 1+1+2+1+2+3+1+2+3+3+4=20          1*4 + 2*3 + 3*2 + 4*1
# 2층 5호 1+1+2+1+2+3+1+2+3+4+1+2+3+4+5=35  1*5 + 2*4 + 3*3 + 4*2 + 5*1

# 3층 1호 1
# 3층 2호 1+1+1+2                           1*3 + 2*1
# 3층 3호 1+1+1+2+1+1+2+1+2+3               1*6 + 2*3 + 3*1
# 3층 4호 1+1+1+2+1+1+2+1+2+3+1+1+2+1+2+3+1+2+3+4     1*10 + 2*6 + 3*3 + 4*1